app/controllers/cups_controller.rb

  def index
    @cups = Cup.all
---
SELECT "cups".* FROM "cups"